// Sample_01.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>


int main()
{
	
	float b = 0.0f;
	//この演算の結果aはNaNになる。
	float a = 0.0f / b;

	float c = 1.0f;
	//この演算の結果cはinfになる。
	for (int i = 0; i < 100; i++) {
		c *= 10.0f;
	}
	//表示してみる。
	printf("a = %f\n", a);
	printf("c = %f\n", c);


	//桁落ちを確認してみる。
	float d = sqrtf(1001.0f);
	float e = sqrt(999.0f);
	float f = d - e;
	//小数点が6桁しか表示されない。
	printf("%f\n", f);

	//情報落ちを確認してみる。
	float g = 1000000000.0f;
	g += 0.5f;
	printf("g = %f\n", g);
}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
