// Sample_01.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>


/// <summary>
/// 引数で渡された値を固定少数点として表示する。
/// </summary>
/// <param name="value"></param>
void DispFixedPoint(int value)
{
    //整数部を抜き出す。
    double f = value >> 8;
    //小数部を加算していく。
    int fValue = value & 0x000000FF;
    for (int i = 0; i < 8; i++) {
        if ((fValue >> (7 - i)) & 1) {
            //ビットがたっている。
            f += powf(2, -(i + 1));
        }
    }

    std::cout << f << "\n";
}
int main()
{
    //value_0に10.625を表す固定小数点数を代入。
    int value_0 = 0b0000000000000000000101010100000;

    //value_1に7.75を表す固定小数点数の値を代入。
    int value_1 = 0b0000000000000000000011111000000;

    //例　value_0 + value_1の結果をvalue_2に代入して固定小数点数として表示する。
    //    10.625 + 7.75 = 18.375
    int value_2 = value_0 + value_1;
    DispFixedPoint(value_2);

    //実習-1 
    // value_1 + value_0の結果をvalue_2に代入しなさい。
    // また、計算結果が 7.75(value_1) + 10.625(value_0) = 18.375‬になっていることを
    // DispFixedPoint関数を利用して確認しなさい。


    //実習-2 
    // value_0 - value_1の結果をvalue_2に代入しなさい。
    // また、計算結果が 10.625(value_0) - 7.75(value_1) = 2.875‬になっていることを
    // DispFixedPoint関数を利用して確認しなさい。
    value_2 = value_0 - value_1;
    DispFixedPoint(value_2);


    //実習-3 
    // value_1 - value_0の結果をvalue_2に代入しなさい。
    // また、計算結果が 7.75(value_1) - 10.625(value_0) = -2.875‬になっていることを
    // DispFixedPoint関数を利用して確認しなさい。
    value_2 = value_1 - value_0;
    DispFixedPoint(value_2);


}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
