// Sample_01.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>


/// <summary>
/// 引数で渡された値を固定少数点として表示する。
/// </summary>
/// <param name="value"></param>
void DispFixedPoint(int value)
{
    //整数部を抜き出す。
    double f = value >> 8;
    //小数部を加算していく。
    int fValue = value & 0x000000FF;
    for (int i = 0; i < 8; i++) {
        if ((fValue >> (7 - i)) & 1) {
            //ビットがたっている。
            f += powf(2, -(i + 1));
        }
    }
    std::cout << f << "\n";
}
int main()
{
    //これを10.625として扱う。
    int value_0 = 0b0000000000000000000101010100000;
    //value_0の値を表示する。
    DispFixedPoint(value_0);

    //実習-1 
    // value_0に7.75を表す固定小数点数の値を代入しなさい。
    // また、正しく作成できているかDispFixedPoint関数を利用して確認しなさい。
    value_0 = 0b0000000000000000000011111000000;
    DispFixedPoint(value_0);

}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
